{
  "version": "21.08.13",
  "description": "Fixed encoding issue where characters were replaced with question marks.",
  "versions": [
    {
    "version": "21.06.11",
    "description": "Updated documentation and CognosDefaults.ps1 example. No new features."
    },
    {
      "version": "21.04.14",
      "description": "Added a FileName parameter to specify saved file name. Included example of Multi User Environment in the CognosDefaults.ps1"
    },
    {
      "version": "21.03.11",
      "description": "Added second authentication attempt because sometimes authentication will fail for no reason but work in a few seconds."
    },
    {
      "version": "21.02.14",
      "description": "Added additional recovery attempts when the Cognos Server returns an error code. Added additional CSV Cleanup Options."
    },
    {
      "version": "21.02.12.01",
      "description": "Fix for capital CSV extension on Linux machines. Removed default string variables for usernames. Updated Synchronous Download example."
    },
    {
      "version": "21.02.12",
      "description": "Synchronously run multiple reports at once. Please don't kill the Cognos Server."
    },
    {
      "version": "21.02.10.01",
      "description": "Fix for reverting file after timeout on download and extra line at the end of output which was breaking imports for 3rd party programs."
    },
    {
      "version": "21.02.09.02",
      "description": "This update includes version checks, file encoding output, fixes for sending emails on errors, additional examples in CognosDefaults.ps1"
    },
    {
      "version": "21.02.04",
      "description": "Craig Millsap - Cognos Analytics 11 upgrade. Saving complex prompts, waiting for report to complete, and validation error messages."
    },
    {
      "version": "18.04.24",
      "description": "Craig Millsap - Recursive nested folders, email notifications, and waiting for live report to generate."
    },
    {
      "version": "18.04.26",
      "description": "Joshua Reed expired email notifications."
    },
    {
      "version": "18.04.26",
      "description": "Scott Organ nested folder support."
    },
    {
      "version": "17.07.12",
      "description": "Charlie Weber contributions"
    },
    {
      "version": "14.07.23",
      "description": "Original by Brian Johnson."
    }
  ]
}
